#ifndef __ZDT_COM_H
#define __ZDT_COM_H

/* Global Macros ----------------------------------------------------------- */

/* Global Types ------------------------------------------------------------ */

typedef enum {
    S_VBUS  = 5,  // 读取总线电压
    S_CBUS  = 6,  // 读取总线电流
    S_CPHA  = 7,  // 读取相电流
    S_ENCO  = 8,  // 读取编码器原始值
    S_CLKC  = 9,  // 读取实时脉冲数
    S_ENCL  = 10, // 读取经过线性化校准后的编码器值
    S_CLKI  = 11, // 读取输入脉冲数
    S_TPOS  = 12, // 读取电机目标位置
    S_SPOS  = 13, // 读取电机实时设定的目标位置
    S_VEL   = 14, // 读取电机实时转速
    S_CPOS  = 15, // 读取电机实时位置
    S_PERR  = 16, // 读取电机位置误差
    S_VBAT  = 17, // 读取多圈编码器电池电压（Y42）
    S_TEMP  = 18, // 读取电机实时温度（Y42 / X42S）
    S_FLAG  = 19, // 读取电机状态标志位
    S_OFLAG = 20, // 读取回零状态标志位
    S_OAF   = 21, // 读取电机状态标志位 + 回零状态标志位（Y42 / X42S）
    S_PIN   = 22, // 读取引脚状态（Y42 / X42S）
    S_SYS   = 23, // 读取系统状态信息（X_V2 扩展）
} zdtSysParams_e;

/* Global Variables -------------------------------------------------------- */

/* Global Functions -------------------------------------------------------- */

#endif
